Repository: vladkorotnev/meekstudio
Catalog: MeekStudio/Windows/frmCharaMover.*.resx
Languages: ru

# btnInsertMove.Text
source: Insert into script
ru: Вставить в код

# btnSetPos.Text
source: Send
ru: Тест

# btnFetchPos.Text
source: Fetch
ru: Чтение

# label1.Text
source: Character
ru: Номер

# groupBox3.Text
source: Position
ru: Координаты

# label2.Text
source: Scroll in the fields for coarse adjustment with preview at the same time.
ru: Скролл колёсиком мыши в полях позволяет быстро менять значения

# btnInsertRot.Text
source: Insert into script
ru: Вставить в код

# btnSendRot.Text
source: Send
ru: Тест

# label4.Text
source: Orientation
ru: Угол, гр.

# label3.Text
source: Character
ru: Номер

# $this.Text
source: Chara mover
ru: Двигать Мику
