Repository: vladkorotnev/meekstudio
Catalog: MeekStudio/Windows/frmCameraMover.*.resx
Languages: ru

# btnFetchStart.Text
source: Fetch
ru: Чтение

# groupBox5.Text
source: Orientation
ru: Ориентация

# groupBox4.Text
source: Focus
ru: Направление

# groupBox3.Text
source: Position
ru: Место

# btnSetStart.Text
source: Preview
ru: Просмотр

# gbxStart.Text
source: Starting position
ru: Начальная точка

# gbxEnd.Text
source: Ending position
ru: Конечная точка

# btnFetchEnd.Text
source: Fetch
ru: Чтение

# groupBox6.Text
source: Orientation
ru: Ориентация

# groupBox7.Text
source: Focus
ru: Направление

# groupBox8.Text
source: Position
ru: Место

# btnSetEnd.Text
source: Preview
ru: Просмотр

# label1.Text
source: Duration
ru: Время, мс.

# btnAnimate.Text
source: Animate
ru: Анимировать

# btnInsert.Text
source: Insert into script
ru: Вставить в код

# label2.Text
source: Scroll in the fields for coarse adjustment with preview at the same time. Which coordinate is lit was last sent to the debug server.
ru: Скролл колёсиком мыши по полям координат — грубая настройка. Подсвеченная координата была последней отправлена в сервер отладки.

# $this.Text
source: Camera Mover
ru: Двигать камеру
