Repository: vladkorotnev/meekstudio
Catalog: libmikuasm/Common/Locales/DSCCommandExplanations.*.resx
Languages: ru

# AUTO_BLINK
source: Makes the character blink the eyes automatically
ru: Запускает автоматическое моргание глаз у персонажа

# BAR_TIME_SET
source: Sets the clock speed of the engine (Legacy command?)
ru: Установка частоты метронома (не используется?)

# CHANGE_FIELD
source: Recalls a stage from the specified slot in the PVDB
ru: Вызывает сцену соответственно выбранному слоту БД

# CHARA_COLOR
source: Adjusts the specified player's color
ru: Настраивает цвет персонажа

# CHARA_HEIGHT_ADJUST
source: Adjusts the character's height
ru: Настраивает высоту персонажа

# CHARA_SIZE
source: Sets the size of the character for the specified player
ru: Настраивает размер персонажа

# CLOTH_WET
source: Sets the cloth wetness effect (darken) of the specified character
ru: Настраивает эффект влажности (затемнение) одежды персонажа

# DATA_CAMERA
source: Begins playback of camera data from the keyframe DB
ru: Воспроизводит анимацию камеры из БД камеры

# EDIT_BLUSH
source: Sets the blush of the currently edited player
ru: Настраивает покраснение персонажа

# EDIT_CAMERA
source: Animates the camera across specified points and time with acceleration
ru: Анимация камеры между точками с ускорением

# EDIT_DISP
source: Sets the visibility of the currently edited character
ru: Включает или выключает показ редактируемого персонажа

# EDIT_FACE
source: Sets the currently edited player's face
ru: Выставляет лицо редактируемого персонажа

# EDIT_SHADOW
source: Sets the visibility of the currently edited character shadow
ru: Включает или выключает тень редактируемого персонажа

# EFFECT_OFF
source: Turns off the effect in the specified slot
ru: Останавливает эффект в соответствующем слоте

# END
source: End of file marker, finishes playback and ends the interpreter
ru: Маркер конца файла, останавливает интерпретатор и заканчивает воспроизведение

# EXPRESSION
source: Sets the specified player to play an expression from the specified expression DB ID
ru: Воспроизводит запрошенное выражение лица из БД лиц

# EYE_ANIM
source: Sets the specified player to animate the eyes with the specified animation
ru: Воспроизводит анимацию глаз

# HAND_ANIM
source: Sets the specified player to animate the hands with the specified animation
ru: Воспроизводит анимацию рук

# HIDE_FIELD
source: Hides or shows the stage
ru: Показывает или скрывает сцену

# LOOK_ANIM
source: Sets the specified player to look at the specified position
ru: Направляет взгляд персонажа в указанную точку

# LYRIC
source: Displays a lyric from the PV DB by the number
ru: Отображает строку слов песни по заданному номеру

# MIKU_DISP
source: Sets the visibility of the specified player
ru: Показывает или скрывает персонажа

# MIKU_MOVE
source: Moves the specified player to the specified position
ru: Перемещает персонажа на заданную точку

# MIKU_ROT
source: Rotates the specified player to the specified orientation
ru: Поворачивает персонажа на заданный угол в градусах

# MIKU_SHADOW
source: Sets the shadow visibility of the specified player
ru: Показывает или скрывает тень персонажа

# MOUTH_ANIM
source: Sets the specified player to animate the mouth with the specified animation
ru: Анимирует рот персонажа

# MOVE_CAMERA
source: Moves the camera across 2 points over a certain time period
ru: Перемещает камеру между двух точек за указанное время и с указанной длительностью ускорения и замедления

# MOVE_FIELD
source: Offsets the stage?
ru: Смещает сцену

# MOVIE_DISP
source: Sets the display state of the movie layer
ru: Показывает или скрывает слой видео

# MOVIE_PLAY
source: Starts playing the movie file
ru: Запускает воспроизведение видео

# MUSIC_PLAY
source: Starts playing the music file
ru: Запускает воспроизведение музыки

# NEAR_CLIP
source: Sets the camera nearclip?
ru: Переключает камеру на крупный план?

# none
source: No help text available.
ru: Справка недоступна для этой команды.

# PV_BRANCH_MODE
source: Specifies the currently played branch. 0 - common, 1 - no success, 2 - success.
ru: Переключает ветку сценария, где 0 - общая, 1 - безуспешная, 2 - успешная.

# PV_END
source: End of PV marker, stops interpreting commands, fades out audio
ru: Конец фильма. Останавливает аудио и завершает показ фильма.

# SATURATE
source: Sets the color saturation of the display. Amount can be specified as integer, percent (e.g. 120%) or decimal (0.5, same as 50%).
ru: Настраивает насыщенность цвета. Можно указывать значение, проценты или десятичные доли.

# SCENE_FADE
source: Performs a display fade in/out with the specified color
ru: Закрывает или открывает изображение выбранным цветом за заданное время

# SET_CAMERA
source: Sets the camera position?
ru: Выставляет позицию камеры?

# SET_CHARA
source: Selects the current character for editing
ru: Выбирает персонажа для редактирования

# SET_MOTION
source: Recalls a motion from the specified PVDB slot for the specified player
ru: Вызывает движение для персонажа из БД

# SE_EFFECT
source: Plays the specified success sound effect
ru: Воспроизводит звук успеха по заданному номеру

# SHADOWHEIGHT
source: Sets the player's shadow height
ru: Выставляет высоту теней персонажа

# TARGET
source: Spawns a target on the screen
ru: Создаёт мишень на экране

# TARGET_FLYING_TIME
source: Sets the speed of the targets
ru: Выставляет скорость мишеней

# TIME
source: Timing marker. If current time is below Timestamp, will wait until it's equal, otherwise no-op. In MikuASM, time can be specified as milliseconds, min:sec.ms, min:sec or sec.ms
ru: Маркер времени. Если текущее время меньше заданного, ждёт до наступления него, иначе не делает ничего. Можно задавать в миллисекундах, мм:сс.мс или сс.мс.

# WIND
source: Sets the wind options for the specified player
ru: Выставляет ветер для персонажа
