Repository: vladkorotnev/meekstudio
Catalog: libmikuasm/Common/Locales/Strings.*.resx
Languages: ja, ru

# BinFltSts
source: Binary import filtering is now {0}
ja: バイナリー入力フィルターを {0} にしました
ru: Фильтр бинарных данных теперь {0}

# ClrBuf
source: Cleared output buffer
ja: 出力バッファーを削除しました
ru: Выходной буфер очищен

# ConstDef
source: Defined {0}={1}
ja: 定義：{0}={1}
ru: Определено {0}={1}

# ConstUndef
source: Undefined {0}
ja: 定義：{0} を削除しました
ru: Определение {0} удалено

# CtxPop
source: Returned to context {0}
ja: コンテキスト {0} に戻りました
ru: Возврат в контекст {0}

# CtxPush
source: Pushed into context {0}
ja: コンテキスト {0} に移動しました
ru: Переход в контекст {0}

# Emit
source: {0}: emitted {1} from {2}
ja: {0}: 出力 {1} （元：{2}）
ru: {0}: выдача {1} из {2}

# ErrArgCount
source: Argument count mismatched.
ja: 不定引数
ru: Неверное число аргументов.

# ErrArgCountLen
source: Not enough arguments: expected {0}, but have {1}
ja: 引数が異常 {0}個必要ですが{1}個定義されます
ru: Не хватает аргументов: нужно {0}, указано {1}

# ErrBranchCount
source: Using more than 3 branches does not look valid.
ja: ブランチ３個以上は非対応です
ru: Больше 3 ветвей не может быть

# ErrCmdNotFound
source: Unknown command {0}
ja: コマンド不明： {0}
ru: Неизвестная команда {0}

# ErrConstSyntax
source: Incorrect const syntax
ja: 定義シンタックス不正
ru: Некорректный синтаксис константы

# ErrConstSyntaxDetail
source: Example: #const name=value
ja: 例）#const 名称=値
ru: Пример: #const ИМЯ=значение

# ErrForArgs
source: Incorrect argument count for {0}
ja: 引数不正： {0}
ru: Неверное число аргументов для {0}

# ErrForArgsDetail
source: Specify args in sets of VARNAME START END STEP
ja: 次のフォーマットで4個ずつ定義してください：名称 スタート値 ストップ値 ステップ
ru: Укажите аргументы квартетами ИМЯ НАЧАЛО КОНЕЦ ШАГ

# ErrInjectionFail
source: Injection failed
ja: プロセス接続失敗
ru: Ошибка внедрения

# ErrKwUndef
source: Cannot undefine a keyword
ja: キーワードの定義を削除できません
ru: Нельзя удалить определение ключевого слова

# ErrNoCommonCmd
source: There are no common branch commands in the script.
ja: 共通ブランチにてコマンドは1個もありません。
ru: В программе нет ни одной команды в общей ветви

# ErrNotExist
source: {0} does not exist!
ja: {0} は存在しません。
ru: {0} не существует

# ErrProcAmbiguous
source: Process name ambiguous: {0}
ja: プロセス{0}が複数あります。
ru: Неопределённый процесс: {0}

# ErrProcNotFound
source: Process not found: {0}
ja: プロセス{0}が存在しません。
ru: Процесс не существует: {0}

# ErrRallocFail
source: Remote alloc failed: 0x{0:X}
ja: リモートメモリー登録エラー 0x{0:X}
ru: Ошибка выделения удалённой памяти 0x{0:X}

# ErrRedef
source: Name already defined.
ja: 定義済み値の再指定
ru: Имя уже определено

# ErrRthreadFail
source: Remote thread creation failed: 0x{0:X} (thread result 0x{0:X})
ja: リモートスレッドエラー 0x{0:X} (結果コード 0x{0:X})
ru: Ошибка удалённого потока 0x{0:X} (результат потока 0x{0:X})

# ErrRwriteFail
source: Remote write failed: 0x{0:X}
ja: リモートメモリー書き込みエラー 0x{0:X}
ru: Ошибка удалённой памяти 0x{0:X}

# ErrTopCtx
source: No open context to close.
ja: ルートコンテキストを閉じられません。
ru: Нельзя закрыть корневой контекст.

# ErrTopCtxDetail
source: Start a context with #ctxstart prior to closing it.
ja: 先に#ctxstartでコンテキストを開いてください。
ru: Откройте контекст командой #ctxstart прежде чем закрывать его.

# ErrUnexpected
source: Unexpected {0}
ru: Неожиданное {0}

# ErrUnknownCmd
source: Command or identifier unknown.
ja: コマンドや定義を見つかりません。
ru: Неизвестное имя или идентификатор.

# ErrUnknownPrepro
source: Invalid preprocessor directive.
ja: 不明プリプロセッサコマンド
ru: Неизвестная директива препроцессора.

# ErrUnko
source: Found an unko.
ja: うんこを発見しました
ru: Наступили в какашку.

# ForceStop
source: Unko!
ja: うんこ
ru: Какашка!

# GotHandle
source: Got handle {0}
ja: ハンドル取得： {0}
ru: Получен хэндл {0}

# IncBin
source: Adding {0} commands from binary {1}
ja: {0}個コマンドをバイナリーデータ {1} から読み込み
ru: Чтение {0} команд из двоичного файла {1}

# Including
source: Reading {0}
ja: {0}から読み込み
ru: Чтение {0}

# InfForLoop
source: Infinite sequence definition for {0}
ja: 無限直列定義： {0}
ru: Несходящаяся последовательность для параметра {0}

# InfForLoopDetail
source: The sequence does not converge with the defined range and step values in a finite number of steps.
ja: 指定されたステップ値で直列が収束しません。
ru: Эта последовательность не сходится за конечное число шагов в указанном диапазоне и при указанном шаге.

# OutsideError
source: This didn't originate from the MikuASM compiler engine...
ja: コンパイラーの外部エラーでした。
ru: Эта ошибка произошла снаружи компилятора.

# PrintSrcError
source: Source code error: {0}
ja: ソース上のエラー: {0}
ru: Ошибка в коде: {0}

# PrintSrcErrorExpand
source: expanded from: {0}
ja: 変換元: {0}
ru: развёрнутом из: {0}

# PrintSrcErrorHelp
source: Extra reference: {0}
ja: 修復情報: {0}
ru: Дополнительная справка: {0}

# PrintSrcErrorLoc
source: at {0} line {1}: {2}
ja: ファイル{0} の{1}行目: {2}
ru: файл {0} строка {1}: {2}

# RthreadCreate
source: Created remote thread {0}
ja: リモートスレッド開始： {0}
ru: Создан удалённый поток {0}

# Sort
source: Sorting timeblocks
ja: タイム順ソート行います
ru: Сортировка кусков по времени

# StsInjected
source: Debug server injected
ja: デバッグサーバー起動成功
ru: Отладочный сервер внедрён

# StsInjecting
source: Injecting debug bridge into PID {0} / pHandle {1}...
ja: デバッグサーバー起動：PID {0} / pHandle {1}...
ru: Внедрение отладочного сервера в PID {0} / pHandle {1}...

# Subst
source: Substituted: {0} into {1}
ja: 変換：{0} → {1}
ru: Подстановка: {0} в {1}

# Verbose
source: Extensive logging enabled as per #chatty
ja: ログ拡張モード有効
ru: По команде #chatty включены дополнительные логи

# WriteBuf
source: Writing current buffer to {0}
ja: バイナリーデータ書き込み：{0}
ru: Запись буфера в двоичный файл {0}
