Repository: vladkorotnev/meekstudio
Catalog: MeekStudio/Locales/Strings.*.resx
Languages: ja, ru

# AboutTitle
source: About {0}
ja: {0}のバージョン情報
ru: О программе {0}

# AboutVersion
source: Version {0}
ru: Версия {0}

# BtnAnimate
source: Animate
ja: 再生
ru: Анимация

# BtnAnimating
source: Animating...
ja: 再生中
ru: Показываем...

# BuildErrorTitle
source: Build error
ja: ビルドエラー
ru: Ошибка сборки

# CloseProjectMsg
source: Are you sure to leave project {0}?
ja: プロジェクト {0} を保存して閉じるよろしいですか？
ru: Закрыть проект {0}?

# CloseProjectTitle
source: Close project
ja: プロジェクトを閉じる
ru: Закрыть

# ConfirmTitle
source: Confirm
ja: 確認
ru: Подтвердить

# DecompileError
source: An error has occurred during decompilation.
ja: データ解析に失敗しました。
ru: Во время декомпиляции произошла ошибка.

# DecompileTitle
source: Decompile: {0}
ja: 解析：{0}
ru: Декомп.: {0}

# DeleteMsg
source: Delete {0}?
ja: {0}を削除します、よろしいですか？
ru: Удалить {0}?

# ErrAlreadyProject
source: This looks like an existing project folder.
ja: このフォルダーは既にプロジェクトが入ってます。
ru: В этой папке уже существует проект.

# ErrBuildFailure
source: Build failure.
ja: ビルドに失敗しました。
ru: Ошибка сборки.

# ErrGameExeNotFound
source: Game exe is not configured or doesn't exist
ja: ゲームアプリのEXEは設定されないか存在しません。
ru: Путь к игре не установлен или не существует.

# ErrNoEditor
source: No script editor is active!
ja: 編集中のスクリプトがありません。
ru: Нет активного редактора скрипта.

# ErrNoProject
source: No project open
ja: プロジェクトを開いてください。
ru: Проект не открыт.

# ErrNotProject
source: This does not seem to be a valid project folder.
ja: プロジェクトフォルダーではありません。
ru: В этой папке проект не найден.

# ErrNotSet
source: {0} not set or does not exist.
ja: {0} は未設定か存在しません。
ru: {0} не указан или не существует.

# FailureTitle
source: Failed
ja: 失敗
ru: Ошибка

# HlpNoneAvail
source: No quick help available.
ja: 説明文章がありません。
ru: Подсказка недоступна.

# ImportFileTitle
source: Import file
ja: ファイルのインポート
ru: Импортировать файл

# MnuAddFile
source: Add file...
ja: ファイルのインポート
ru: Добавить файл...

# MnuDelFile
source: Delete
ja: 削除
ru: Удалить

# MnuEvalFile
source: Execute file
ja: ファイルを実行
ru: Выполнить файл

# MnuNewFile
source: New file
ja: ファイル作成
ru: Новый файл

# MnuNewFolder
source: New folder
ja: フォルダー作成
ru: Новая папка

# MnuPvDbCleanUp
source: Clean up and reorder
ja: クリーンアップ
ru: Упорядочить поля

# MnuRenFile
source: Rename
ja: 名称変更
ru: Переименовать

# MnuSetAs
source: Set as...
ja: ファイル登録
ru: Использовать как...

# MsgPreviewing
source: Preview in progress, end to continue.
ja: プレビュー再生中です。続くようにプレビューを終了してください。
ru: Завершите просмотр для продолжения

# MsgWaitSelector
source: Please set the game on song selector screen, then click OK to attach
ja: ゲームアプリの楽曲一覧画面を表示させてOKを押してください。
ru: Выйдите на экран списка песен в игре и нажмите ОК для продолжения.

# OpenProjectTitle
source: Select a project folder
ja: プロジェクトのフォルダーを選択してください。
ru: Выберите проект

# SelectFolderTitle
source: Select a folder for the project to reside in
ja: プロジェクトのフォルダーを選択してください。
ru: Выберите папку для создания проекта

# StsBuildFinish
source: Build finished in {0} seconds
ja: ビルドに成功しました （{0} s）
ru: Проект успешно собран за {0} секунд

# StsBuildStart
source: Build started: {0}
ja: ビルド開始：{0}
ru: Сборка начата: {0}

# StsCannotChgThing
source: Could not set {0}
ja: {0}を登録できませんでした。
ru: Не удалось выставить {0}

# StsChangedThing
source: Set {0} to {1}
ja: {1} を {0} として登録しました。
ru: Изменён {0} на {1}

# StsCompile
source: Compile: {0}
ja: コンパイル：{0}
ru: Компиляция: {0}

# StsDecompiled
source: Decompiled {0} in {1} seconds
ja: {0}：解析完了 （{1} s）
ru: Декомпилирован {0} за {1} секунд

# StsDecompileError
source: Could not decompile {0}: {1}
ja: {0}： 解析失敗（{1}）
ru: Не получилось декомпилировать {0}: {1}

# StsEmit
source: Build: {0}
ja: 出力：{0}
ru: Построен: {0}

# StsEval
source: Evaluated: {0}
ja: 実行：{0}
ru: Выполнено: {0}

# StsGameAttached
source: Attached to game process
ja: ゲームアプリに接続しました。
ru: Подключились к процессу игры

# StsGameDetached
source: Detached from game process
ja: ゲームアプリから接続中断しました。
ru: Отключились от процесса игры

# StsGameNotAttached
source: Not attached!
ja: ゲームアプリに接続していません。
ru: Не подключено к процессу игры!

# StsNotScript
source: This is not a script!
ja: 編集中ファイルはスクリプトではありません。
ru: Это не файл скрипта!

# StsProjectClose
source: Project unloaded
ja: プロジェクトを閉まりました。
ru: Проект закрыт

# StsProjectNew
source: Created new project {0}
ja: {0} を新規作成しました。
ru: Создан проект {0}

# StsProjectOpen
source: Loaded project {0}
ja: {0} を読み込みしました。
ru: Загружен проект {0}

# StsPvDbCleanedUp
source: Cleaned up PVDB entry file
ja: クリーンアップに成功しました。
ru: Упорядочивание полей завершено

# StsStartingDebug
source: Starting debug instance
ja: ゲームアプリのデバッグ起動中
ru: Запуск игры для отладки

# StsStartingPreview
source: Starting up preview
ja: プレビュー起動中
ru: Запуск игры для просмотра

# StsWaitReattach
source: Waiting for application to reattach...
ja: ゲームアプリに再接続の待機中
ru: Ожидание переподключения к игре...

# ThingEntrypoint
source: entrypoint script
ja: エントリーポイント
ru: Файл точки входа

# ThingMovieAudio
source: movie audio
ja: 音声データ
ru: Файл музыки

# ThingMovieDsc
source: movie output
ja: 動画スクリプト出力データ
ru: Файл выходного скрипта фильма

# ThingPvDb
source: PV DB snippet
ja: PV DB データ
ru: Файл фрагмента PV DB

# WaitSelectorTitle
source: Attach to game
ja: ゲームアプリに接続
ru: Подключение к игре
